const colleges = [
  { name: '경희대학교', lat: 37.596195, lon: 127.052544 },
  { name: '고려대학교', lat: 37.590799, lon: 127.027777 },
  { name: '광운대학교', lat: 37.619507, lon: 127.058988 },
  { name: '국민대학교', lat: 37.609641, lon: 126.997697 },
  { name: '명지대학교', lat: 37.580107, lon: 126.923155 },
  { name: '서강대학교', lat: 37.551337, lon: 126.940753 },
  { name: '서울대학교', lat: 37.459882, lon: 126.951905 },
  { name: '성균관대학교', lat: 37.588227, lon: 126.993606 },
  { name: '세종대학교', lat: 37.55026, lon: 127.073139 },
  { name: '숭실대학교', lat: 37.496375, lon: 126.956879 },
  { name: '연세대학교', lat: 37.565784, lon: 126.938572 },
  { name: '중앙대학교', lat: 37.504147, lon: 126.956954 },
  { name: '한양대학교', lat: 37.557232, lon: 127.045322 },
  { name: '홍익대학교', lat: 37.551711, lon: 126.926116 },
];

export default colleges;
