from decimal import Decimal
def 월세(x):
    gradient = Decimal((70-30)/(56515000-30379000))
    prc = gradient * (x-30379000) + 30
    return round(prc,-1)

def 보증금(x):
    gradient = Decimal((1000-500)/(56515000-30379000))
    prc = gradient * (x-30379000) + 500
    return round(prc,-2)
def main():
    prc = [
            # 87275000,85552000,66610000,61026000,
            56515000,52793000,52014000,50216000,
            47949000,47691000,47127000,46906000,
            46721000,40596000,39441000,37810000,
            35940000,35679000,35253000,35029000,
            33795000,31782000,30828000,30818000,
            30379000]

    area = [
        # '강남구', '서초구', '용산구', '송파구',
            '성동구', '마포구', '광진구', '양천구',
            '동작구', '종로구', '강동구', '영등포구',
            '중구', '강서구', '서대문구', '동대문구',
            '은평구', '성북구', '노원구', '관악구',
            '구로구', '중랑구', '금천구', '강북구',
            '도봉구']

    countOfSeoulGu = len(area)


    for i in range(0,countOfSeoulGu):
        print("%s : %d %d"%(area[i],보증금(prc[i]),월세(prc[i])))

if __name__ == "__main__":
    main()
